deploy/animazon-tech/app/Http/Controllers/CostCalculatorController.php

select * from "project_types" where "project_types"."parent_id" in (1, 5, 11, 15) and "active" = 1 order by "name" asc
---
    public function publicIndex()
    {
        $categories = ProjectType::whereNull('parent_id')
            ->where('active', true)
            ->with(['children' => function ($q) {
                $q->where('active', true)->orderBy('name');
            }])
            ->orderBy('name')
            ->get();