deploy/animazon-tech/app/Http/Controllers/DashboardController.php

select * from "plans"
---
    public function landingPage()
    {
        if (!file_exists(storage_path() . "/installed")) {
            header('location:install');
            die;
        }

        $adminSettings = Utility::settings();
        $plans = Plan::get();